# DataFrame Reshape

In [1]:
import pandas as pd

In [10]:
dictdf = {"EmpName" : ["Jacob","Marcos","Dane"],
     "EmpID" : [111,222,333],
     "EmpTitle" : ["Banker","Team Manager","Analyst"]}
df = pd.DataFrame(dictdf)

In [11]:
df

  EmpName  EmpID      EmpTitle
0   Jacob    111        Banker
1  Marcos    222  Team Manager
2    Dane    333       Analyst

In [18]:
df_melted = pd.melt(df, 
                    id_vars=["EmpID"], 
                    value_vars=["EmpName", "EmpTitle"])

df_melted

   EmpID  variable         value
0    111   EmpName         Jacob
1    222   EmpName        Marcos
2    333   EmpName          Dane
3    111  EmpTitle        Banker
4    222  EmpTitle  Team Manager
5    333  EmpTitle       Analyst

In [19]:
df_melted1 = pd.melt(df, 
                    id_vars=["EmpID","EmpName"], 
                    value_vars=["EmpTitle"])

df_melted1

   EmpID EmpName  variable         value
0    111   Jacob  EmpTitle        Banker
1    222  Marcos  EmpTitle  Team Manager
2    333    Dane  EmpTitle       Analyst

In [21]:
df_melted2 = pd.melt(df, 
                    id_vars=["EmpName"], 
                    value_vars=["EmpTitle"])

df_melted2

  EmpName  variable         value
0   Jacob  EmpTitle        Banker
1  Marcos  EmpTitle  Team Manager
2    Dane  EmpTitle       Analyst

### Stack

In [23]:
df_stack = df.stack()
df_stack

0  EmpName            Jacob
   EmpID                111
   EmpTitle          Banker
1  EmpName           Marcos
   EmpID                222
   EmpTitle    Team Manager
2  EmpName             Dane
   EmpID                333
   EmpTitle         Analyst
dtype: object

### Unstack

In [24]:
df_unstack = df.unstack()
df_unstack

EmpName   0           Jacob
          1          Marcos
          2            Dane
EmpID     0             111
          1             222
          2             333
EmpTitle  0          Banker
          1    Team Manager
          2         Analyst
dtype: object